config.org
#+TITLE: EmacsConfig
#+AUTHOR: Rich Hewitt
#+EMAIL: richard.hewitt@manchester.ac.uk
#+STARTUP: indent
#+PROPERTY: header-args :results silent

To convert this to "./config.el" do M-x org-babel-tangle.

Note: originally packages were installed by use-packages :ensure t
mechanism. As of 2022 this is replaced in favour of a NixOS
home-manager configuration that manages most (but not all) of the
packages.
 
* Basic setup
** Package archives: ELPA/MELPA
Standard content to configure ELPA and MELPA for packages.

Custom settings points to ~/.emacs.d/custom-settings.el but this is
not controlled by "home-manager" in my NixOS configuration so these
custom settings should be treated as both transient and machine
specific.


#+BEGIN_SRC emacs-lisp :tangle yes
  ;;;;
  ;;;; CONFIGURE MELPA AND GNU ARCHIVES
  ;;;;
  (require 'package)
  (setq package-archives
        '(("GNU ELPA"     . "https://elpa.gnu.org/packages/")
          ("MELPA"        . "https://melpa.org/packages/"))
        package-archive-priorities ; prefer ELPA to MELPA
        '(("GNU ELPA"     . 10)
          ("MELPA"        . 5 )))
  (package-initialize)

  ;;;;
  ;;;; CONFIGURE USE-PACKAGE TO AUTOLOAD THINGS : https://github.com/jwiegley/use-package
  ;;;;
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package) )

  ;; this is the standard use-package invocation if it is in ~/.emacs.d
  (eval-when-compile
    (require 'use-package) )

  ;; Keep custom settings in a separate file to not pollute this one
  (setq custom-file "/home/hewitt/.emacs.d/custom-settings.el")
  (load custom-file t)

  ;; quelpa set up to allow 'age to be used below
  ;; currently not required as everything is in (M)ELPA [Jan 2023]
  ;; (quelpa
  ;;  '(quelpa-use-package
  ;;    :fetcher git
  ;;    :url "https://github.com/quelpa/quelpa-use-package.git"))
  ;; (require 'quelpa-use-package)
#+END_SRC

** Change some of the default emacs variables
Some random minor tweaks. Turn off scroll bar, tool bar, menu bar.
Move all backups to a single folder. Minor tweaks to garbage
collection.

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; move backups to stop *~ proliferation
  (setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
  ;; have mouse input in the terminal
  ;; the disadvantage is you need to SHIFT+middle mouse to paste in the terminal
  (xterm-mouse-mode 1)
  ;; Turn off the menu/scroll/toolbar
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  ;; this stops the cursor recentering on leaving the page
  ;; ie. stop scrolling by 0.5 page
  (setq scroll-conservatively 101 )
  ;; replace annoying yes/no with y/n
  (fset 'yes-or-no-p 'y-or-n-p)
  ;; don't end sentences with a double space
  (setq sentence-end-double-space nil)
  ;; the frequency of garbage collection
  (setq gc-cons-threshold 8000000 ) ; i.e., every ~8MB
  ;; report GC events
  (setq garbage-collection-messages t)
  ;; warn when opening files bigger than 80MB
  (setq large-file-warning-threshold 80000000)
  ;; always follow the symlink
  (setq vc-follow-symlinks t)
  #+END_SRC

** Update buffer contents when file changes on "disk"
When editing the same file on a shared drive/remote machine, make sure
that we update any open buffers to show the on-file current status.

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Source: http://www.emacswiki.org/emacs-en/download/misc-cmds.el
  ;; This COMMAND will reload a buffer if it changes on disk, which is
  ;; key if editing from multiple machines over long periods.
  ;(defun revert-buffer-no-confirm ()
  ;  "Revert buffer without confirmation."
  ;  (interactive)
  ;  (revert-buffer :ignore-auto :noconfirm))
  (global-auto-revert-mode)
#+END_SRC

** Add custom file extensions to set major modes
I use "m4" to update headers/footers/dates in LaTeX files for leccture
course material. So here we default to latex-mode for .m4 extensions.
In addition ".gnu" for Gnuplot and ".m" for Octave.

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; setup files ending in “.m4” to open in LaTeX-mode
  ;; for use in lecture note construction
  (add-to-list 'auto-mode-alist '("\\.m4\\'" . latex-mode))
  ;; my default gnuplot extension
  (add-to-list 'auto-mode-alist '("\\.gnu\\'" . gnuplot-mode))
  ;; Octave/Matlab
  (add-to-list 'auto-mode-alist '("\\.m\\'" . octave-mode))
  ;; Nix language
  (add-to-list 'auto-mode-alist '("\\.nix\\'" . nix-mode))
#+END_SRC


* Appearance
  
** Delight
Delight declutters the modeline by reducing the amount of mode
information.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package delight
    ;;ensure t
    :init (message "Use-package: Delight") )
  ;; delight some basic modes to get rid of modeline content
  (delight 'eldoc-mode "" 'eldoc)
  (delight 'abbrev-mode "" 'abbrev)
#+END_SRC

** Dashboard
Dashboard is the startup screen for quick access to previously used
material.

*Ongoing issue* [May 2022] Dashboard is currently turned off because
it causes issues with "emacs --daemon" on NixOS. See:
https://github.com/emacs-dashboard/emacs-dashboard/issues/373

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; dashboard runs at startup by default
  (use-package dashboard
    ;;ensure t
    :delight "Dash"
    :init
    (message "Use-package: Dashboard")
    :config
    (setq dashboard-banner-logo-title "Go!")
    (setq dashboard-startup-banner '2) ; 1,2,3 are the text banners
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-file-icons t)
    (setq dashboard-items '((recents  . 10)
                            (bookmarks . 5)
                            (agenda . 4)))
    (dashboard-setup-startup-hook)
    ;(dashboard-refresh-buffer)
    )
  ;; show dashboard on startup for emacsclients when running the daemon
  (setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*"))) 
#+END_SRC

