config.el
;;;;
;;;; CONFIGURE MELPA AND GNU ARCHIVES
;;;;
(require 'package)
(setq package-archives
      '(("GNU ELPA"     . "https://elpa.gnu.org/packages/")
        ("MELPA"        . "https://melpa.org/packages/"))
      package-archive-priorities ; prefer ELPA to MELPA
      '(("GNU ELPA"     . 10)
        ("MELPA"        . 5 )))
(package-initialize)

;;;;
;;;; CONFIGURE USE-PACKAGE TO AUTOLOAD THINGS : https://github.com/jwiegley/use-package
;;;;
;;(unless (package-installed-p 'use-package)
;;  (package-refresh-contents)
;;  (package-install 'use-package) )

;; this is the standard use-package invocation if it is in ~/.emacs.d
;;(eval-when-compile
;;  (require 'use-package) )

;; Keep custom settings in a separate file to not pollute this one
(setq custom-file "/home/hewitt/.emacs.d/custom-settings.el")
(load custom-file t)

;; move backups to stop *~ proliferation
(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
;; have mouse input in the terminal
;; the disadvantage is you need to SHIFT+middle mouse to paste in the terminal
(xterm-mouse-mode 1)
;; Turn off the menu/scroll/toolbar
(menu-bar-mode -1)
(scroll-bar-mode -1)
(tool-bar-mode -1)
;; this stops the cursor recentering on leaving the page
;; ie. stop scrolling by 0.5 page
(setq scroll-conservatively 101 )
;; replace annoying yes/no with y/n
(fset 'yes-or-no-p 'y-or-n-p)
;; don't end sentences with a double space
(setq sentence-end-double-space nil)
;; the frequency of garbage collection
(setq gc-cons-threshold 8000000 ) ; i.e., every ~8MB
;; report GC events
(setq garbage-collection-messages t)
;; warn when opening files bigger than 80MB
(setq large-file-warning-threshold 80000000)
;; always follow the symlink
(setq vc-follow-symlinks t)

;; Source: http://www.emacswiki.org/emacs-en/download/misc-cmds.el
;; This COMMAND will reload a buffer if it changes on disk, which is
;; key if editing from multiple machines over long periods.
;(defun revert-buffer-no-confirm ()
;  "Revert buffer without confirmation."
;  (interactive)
;  (revert-buffer :ignore-auto :noconfirm))
(global-auto-revert-mode)

;; setup files ending in “.m4” to open in LaTeX-mode
;; for use in lecture note construction
(add-to-list 'auto-mode-alist '("\\.m4\\'" . latex-mode))
;; my default gnuplot extension
(add-to-list 'auto-mode-alist '("\\.gnu\\'" . gnuplot-mode))
;; Octave/Matlab
(add-to-list 'auto-mode-alist '("\\.m\\'" . octave-mode))
;; Nix language
(add-to-list 'auto-mode-alist '("\\.nix\\'" . nix-mode))

(use-package delight
  ;;ensure t
  :init (message "Use-package: Delight") )
;; delight some basic modes to get rid of modeline content
(delight 'eldoc-mode "" 'eldoc)
(delight 'abbrev-mode "" 'abbrev)

;; dashboard runs at startup by default
(use-package dashboard
  ;;ensure t
  :delight "Dash"
  :init
  (message "Use-package: Dashboard")
  :config
  (setq dashboard-banner-logo-title "Go!")
  (setq dashboard-startup-banner '2) ; 1,2,3 are the text banners
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-items '((recents  . 10)
                          (bookmarks . 5)
                          (agenda . 4)))
  (dashboard-setup-startup-hook)
  ;(dashboard-refresh-buffer)
  )
;; show dashboard on startup for emacsclients when running the daemon
(setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
