config.org
** Prot's themes 
I've switched to the more systematic themes from Protesilaos Stavrou,
and most recently his ef-themes.

Fonts: The defailt font is now set via custom-settings.el since it is machine
specific given each has its own DPI settings.

#+BEGIN_SRC emacs-lisp :tangle no
  ;; My typical font on hi-dpi displays
  ;;(set-face-attribute 'default nil
  ;;                    :family "Iosevka Term SS05" :height 110 :weight 'regular :width 'regular )
  ;;(set-face-attribute 'variable-pitch nil
  ;;                    :family "Iosevka" :height 1.0 :weight 'regular)
  ;;(set-face-attribute 'fixed-pitch nil
  ;;                    :family "Iosevka Term SS05" :height 1.0 :weight 'regular :width 'regular )
  ;; for non-hi-dpi displays, below is now set via custom-settings.el
  ;;(set-face-attribute 'default nil
  ;;                     :family "Terminus" :height 120 :weight 'medium :width 'normal )
  ;;(set-face-attribute 'fixed-pitch nil
  ;;                     :family "Terminus" :height 120 :weight 'medium :width 'normal )
  (setq-default line-spacing 0.2) 
  (use-package modus-themes
    ;;ensure t
    :init
    ;; Add all your customizations prior to loading the themes
    (setq modus-themes-italic-constructs t
          modus-themes-bold-constructs nil
          modus-themes-mixed-fonts nil
          modus-themes-subtle-line-numbers nil
          modus-themes-intense-mouseovers nil
          modus-themes-deuteranopia nil
          modus-themes-tabs-accented t
          modus-themes-variable-pitch-ui nil
          modus-themes-inhibit-reload t ; only applies to `customize-set-variable' and related
          modus-themes-fringes 'intense ; {nil,'subtle,'intense}

          ;; Options for `modus-themes-lang-checkers' are either nil (the
          ;; default), or a list of properties that may include any of those
          ;; symbols: `straight-underline', `text-also', `background',
          ;; `intense' OR `faint'.          
          modus-themes-lang-checkers nil

          ;; Options for `modus-themes-mode-line' are either nil, or a list
          ;; that can combine any of `3d' OR `moody', `borderless',
          ;; `accented', a natural number for extra padding (or a cons cell
          ;; of padding and NATNUM), and a floating point for the height of
          ;; the text relative to the base font size (or a cons cell of
          ;; height and FLOAT)
          modus-themes-mode-line '(accented borderless (padding . 2) (height . 1.0))

          ;; Same as above
          ;; modus-themes-mode-line '(accented borderless 4 0.9)

          ;; Options for `modus-themes-markup' are either nil, or a list
          ;; that can combine any of `bold', `italic', `background',
          ;; `intense'.
          modus-themes-markup '(background italic)

          ;; Options for `modus-themes-syntax' are either nil (the default),
          ;; or a list of properties that may include any of those symbols:
          ;; `faint', `yellow-comments', `green-strings', `alt-syntax'
          modus-themes-syntax '(yellow-comments green-strings alt-syntax)

          ;; Options for `modus-themes-hl-line' are either nil (the default),
          ;; or a list of properties that may include any of those symbols:
          ;; `accented', `underline', `intense'
          modus-themes-hl-line '(intense accented)

          ;; Options for `modus-themes-paren-match' are either nil (the
          ;; default), or a list of properties that may include any of those
          ;; symbols: `bold', `intense', `underline'
          modus-themes-paren-match '(bold intense)

          ;; Options for `modus-themes-links' are either nil (the default),
          ;; or a list of properties that may include any of those symbols:
          ;; `neutral-underline' OR `no-underline', `faint' OR `no-color',
          ;; `bold', `italic', `background'
          modus-themes-links '(neutral-underline background)

          ;; Options for `modus-themes-box-buttons' are either nil (the
          ;; default), or a list that can combine any of `flat', `accented',
          ;; `faint', `variable-pitch', `underline', `all-buttons', the
          ;; symbol of any font weight as listed in `modus-themes-weights',
          ;; and a floating point number (e.g. 0.9) for the height of the
          ;; button's text.
          modus-themes-box-buttons '(variable-pitch flat faint 0.9)

          ;; Options for `modus-themes-prompts' are either nil (the
          ;; default), or a list of properties that may include any of those
          ;; symbols: `background', `bold', `gray', `intense', `italic'
          modus-themes-prompts '(intense bold)

          ;; The `modus-themes-completions' is an alist that reads three
          ;; keys: `matches', `selection', `popup'.  Each accepts a nil
          ;; value (or empty list) or a list of properties that can include
          ;; any of the following (for WEIGHT read further below)
          ;;
          ;; `matches' - `background', `intense', `underline', `italic', WEIGHT
          ;; `selection' - `accented', `intense', `underline', `italic', `text-also' WEIGHT
          ;; `popup' - same as `selected'
          ;; `t' - applies to any key not explicitly referenced (check docs)
          ;;
          ;; WEIGHT is a symbol such as `semibold', `light', or anything
          ;; covered in `modus-themes-weights'.  Bold is used in the absence
          ;; of an explicit WEIGHT.
          modus-themes-completions '((matches . (extrabold))
                                     (selection . (semibold accented))
                                     (popup . (accented intense)))

          modus-themes-mail-citations nil ; {nil,'intense,'faint,'monochrome}

          ;; Options for `modus-themes-region' are either nil (the default),
          ;; or a list of properties that may include any of those symbols:
          ;; `no-extend', `bg-only', `accented'
          modus-themes-region '(bg-only no-extend)

          ;; Options for `modus-themes-diffs': nil, 'desaturated, 'bg-only
          modus-themes-diffs 'desaturated

          modus-themes-org-blocks 'gray-background ; {nil,'gray-background,'tinted-background}
          )

    ;; Load the theme files before enabling a theme
    ;;(modus-themes-load-themes)
    :config
    ;; allow for color changes 
    ;; so far I've only lifted bg-main up slightly
    (setq modus-themes-vivendi-color-overrides ; dark
          '((bg-main . "#282828") ; I've lifted this bg to match foot.ini, breaking contrast levels
            (bg-hl-line . "#484848")
            ))
    ;;(setq modus-themes-operandi-color-overrides ; light
    ;;      '((bg-main . "#fbf3db") ; lowered contrast of fg vs bg
    ;;        (fg-main . "#53676d")))

    ;;Load the theme of your choice:
    ;; (modus-themes-load-vivendi) ;; OR (modus-themes-load-vivendi)
    :bind ("<f5>" . modus-themes-toggle))
  #+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Disable all other themes to avoid awkward blending:    
  (use-package ef-themes
    :init
    (mapc #'disable-theme custom-enabled-themes)
    ;; Make customisations that affect Emacs faces BEFORE loading a theme
    ;; (any change needs a theme re-load to take effect).
    (setq ef-themes-to-toggle '(ef-day ef-winter))
    ;;:config
    ;; Load the theme of choice:
    ;;(load-theme 'ef-summer :no-confirm)
    ;; Light: `ef-day', `ef-light', `ef-spring', `ef-summer'.
    ;; Dark:  `ef-autumn', `ef-dark', `ef-night', `ef-winter'.

    ;; I set the theme at the end of this configuration because of
    ;; some minor issues with code comments showing as underlined [2022]
    )
#+END_SRC
  
** Modeline (doom)
Doom modeline is my default choice, just to add a bit of usability to
the standard mode line.

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package doom-modeline
  ;;ensure t
  :init (message "Use-package: Doom-modeline")
  :hook (after-init . doom-modeline-mode)
  :config
  ;; Whether display icons or not (if nil nothing will be showed).
  (setq doom-modeline-icon t)
  ;; Display the icon for the major mode. 
  (setq doom-modeline-major-mode-icon t )
  ;; Display color icons for `major-mode' 
  (setq doom-modeline-major-mode-color-icon t)
  ;; Display minor modes or not?
  (setq doom-modeline-minor-modes t)
  ;; Whether display icons for buffer states.
  (setq doom-modeline-buffer-state-icon t)
  ;; Whether display buffer modification icon.
  (setq doom-modeline-buffer-modification-icon t)
  ;; If non-nil, a word count will be added to the selection-info modeline segment.
  (setq doom-modeline-enable-word-count nil)
  ;; If non-nil, only display one number for checker information if applicable.
  ; (setq doom-modeline-checker-simple-format t)
  ;; The maximum displayed length of the branch name of version control.
  (setq doom-modeline-vcs-max-length 6)
  ;; Whether display perspective name or not. Non-nil to display in mode-line.
  ;(setq doom-modeline-persp-name t)
  ;; Whether display `lsp' state or not. Non-nil to display in mode-line.
  (setq doom-modeline-lsp t)  )
#+END_SRC

** Rainbow-delimiters
Colorised brackets to make matching easier.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package rainbow-delimiters
    ;;ensure t
    :init
    (message "Use-package: Rainbow delimiters")
    :config
    (rainbow-delimiters-mode)
    (add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
    (add-hook 'latex-mode-hook 'rainbow-delimiters-mode) )
#+END_SRC

** Which-key
Popup a description of key combinations after a delay.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package which-key
    ;;ensure t
    :delight 
    :init 
    (message "Use-package: Which-key mode")
    :config
    (setq which-key-idle-delay 0.25)
    (which-key-mode) )
#+END_SRC

** Appearance hooks for modes

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; latex  
  (add-hook 'latex-mode-hook 'flyspell-mode)
  (add-hook 'latex-mode-hook 'hl-line-mode)
  ;; programming
  (add-hook 'prog-mode-hook 'hl-line-mode)
  ;; org-mode
  (add-hook 'org-mode-hook 'hl-line-mode)
  (add-hook 'org-mode-hook 'flyspell-mode)
  (add-hook 'org-mode-hook 'visual-line-mode)
#+END_SRC


* Narrowing and completion
** Overview
A useful overview from: https://www.reddit.com/r/emacs/comments/k3c0u7/consult_counselswiper_alternative_for/

The minibuffer completion uses:

+ "completing-read" to define what the completion UI looks like and
  how it behaves.

+ "completing-styles" to define how completion filter/sorts results
  (e.g. does typing "fi fil" match "find-file").

In terms of packages:

+ "icomplete", "fido" and "Selectrum" all just set the
  "completing-read" function and implement continuous completion on
  each key press (not technically true for "icomplete" for close
  enough).

+ "Orderless", "Prescient", and the built-in "flex" are
  completion-styles to allow convenient filters like regex, and
  sorting by frequency/recency.

+ "icomplete-vertical" is a minor mode to make "icomplete" vertical.

+ "Consult" is a set of functions to use various Emacs facilities via
  completing-read.

+ "Embark" is a minor mode to allow each minibuffer entry to have
  multiple actions.

All of the above try to use the minibuffer's existing hooks and
extension mechanisms, and benefit from large parts of the rest of
Emacs using those mechanisms too. Consequently, they all interoperate
with each other and other parts of the Emacs ecosystem. You can pick
which you want.

Modes that don't attempt to interoperate (and I avoid):

+ "Ido" performs the same role as "completing-read", but doesn't set
  "completing-read" and so only works for functions that use Ido's own
  completing function. "ido-ubiquitious" sets ido to be
  completing-read. ido appears to be considered somewhat deprecated on
  emacs-devel, in favour of icomplete.

+ "Ivy" doesn't use completing-read at all, and does its own filtering
  (rather than use completion-styles).

+ "Swiper" uses Ivy. I replace with just `C-s`.

+ "Counsel" is a set of functions to use various parts of Emacs via
  minibuffer completion. Very convenient, but only works if you also
  have "Ivy/Swiper". "Consult" is like "Counsel" but uses the built-in
  minibuffer completion.

+ "Helm" doesn't use "completing-read", but does add multiple actions
  on each selection. I would use "embark" if I wanted this
  functionality, but I don't.


