config.org
** Implementation 1 : everything done using standard completing-read interface
- Use Vertico (with Orderless) as a smaller solution for
  incremental completion in Emacs.

- I like vertico-posframe. I'm not sure if I should. This mode is
  started only when a frame is made (see the end of the config file).
  
- marginalia-mode adds marginalia to the minibuffer completions.
  Marginalia can only add annotations to be displayed with the
  completion candidates.

- Consult provides various practical commands based on the
  Emacs completion function completing-read, which allows to quickly
  select an item from a list of candidates with completion. Consult
  offers in particular an advanced buffer switching command
  consult-buffer to switch between buffers and recently opened files.
  Multiple search commands are provided, an asynchronous consult-grep
  and consult-ripgrep, and consult-line, which resembles Swiper.
   
#+BEGIN_SRC emacs-lisp :tangle yes
    (use-package consult
      ;;ensure t
      :after key-seq
      :init
      (message "Use-package: consult")
      :bind
      ;; see also key-chords elsewhere
      ("C-x b" . consult-buffer)
      ("M-g g" . consult-goto-line)
      ("M-y"   . consult-yank-pop)
      ("C-y"   . yank)
      ("C-s"   . consult-line)
      ("M-g o" . consult-outline))

      ;; define some related chords
      (key-seq-define-global "qq"     'consult-buffer)
      (key-seq-define-global "qb"     'consult-bookmark) ; set or jump
      (key-seq-define-global "ql"     'consult-goto-line)

    (use-package consult-notes
      :commands (consult-notes consult-notes-search-in-all-notes)
      :config
      ;(setq consult-notes-file-dir-sources
      ;      '(("Org"         ?o "~/Sync/Org/Denote/")
      ;        ("Journal"      ?j "~/Sync/Org/Journal/")))    
      ;(consult-notes-org-headings-mode)
      (consult-notes-denote-mode))

    (use-package vertico
      ;;ensure t
      :custom
      (vertico-cycle t)
      :init
      (message "Use-package: vertico")
      (vertico-mode))

    (use-package savehist
      :init
      (savehist-mode))

    (use-package vertico-posframe
      :config
      (setq vertico-posframe-border-width 3)
      (setq vertico-posframe-mode t)
      (setq vertico-posframe-poshandler 'posframe-poshandler-frame-top-center)
      (setq vertico-posframe-width 100))

    (use-package orderless
      ;;ensure t
      :custom (completion-styles '(orderless)))

    (use-package marginalia
      :after vertico
      ;;ensure t
      :custom
      (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
      :init
      (message "Use-package: marginalia")
      (marginalia-mode))
#+END_SRC


** Implementation 2 : customised via Ivy+Counsel+Swiper
- has ivy-posframe - Note: vertico (above in implementation 1) now has a posframe version. 
- disadvantage of it being monolithic.

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package swiper
    ;;ensure t
    :config
    :bind
    ("C-s" . swiper)             ;; Use swiper for search 
    )

  (use-package counsel
    ;;ensure t
    :after key-seq
    :bind
    ("M-x" . counsel-M-x)
    ("C-x C-f" . counsel-find-file)
    ("C-y" . counsel-yank-pop)
    :config
    (progn
      (key-seq-define-global "qq"     'counsel-switch-buffer)
      (key-seq-define-global "qb"     'counsel-bookmark) ; set or jump
      (key-seq-define-global "qo"     'counsel-imenu) 
      (key-seq-define-global "qc"     'counsel-org-capture) ))

  (use-package ivy
    ;;ensure t
    :delight
    :config
    (setq ivy-use-virtual-buffers t
          ivy-count-format "%d/%d ")
    (ivy-mode 1) )

  (use-package ivy-prescient
    ;;ensure t
    :config
    (ivy-prescient-mode 1) )

  ;; popup ivy completion in a separate frame top centre instead of in the minibuffer
  (use-package ivy-posframe
    ;;ensure t
    :after ivy
    :delight 
    :custom-face
    (ivy-posframe-border ((t (:background "#ffffff"))))
    :config
    (ivy-posframe-mode 1)
    (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-top-center)))
    (setq ivy-posframe-height-alist '((t . 10))
          ivy-posframe-parameters '((internal-border-width . 10)))
    (setq ivy-posframe-parameters
          '((left-fringe . 10)
            (right-fringe . 10)))
    ;;(setq ivy-posframe-parameters '((alpha . 0.95)))
    )

  ;; ivy alternative to marginalia
  (use-package ivy-rich
    ;;ensure t
    :init
    (ivy-rich-mode 1) )

  ;; adds icons to buffer list
  (use-package all-the-icons-ivy-rich
    ;;ensure t
    :init
    (all-the-icons-ivy-rich-mode 1) )
#+END_SRC


* Interaction
** Cut and paste
I use Wayland (no X11), and this interacts with wl-copy.

#+BEGIN_SRC emacs-lisp :tangle no
  ;; - cut and paste in Wayland environment
  ;; - this puts selected text into the Wayland clipboard
  (setq x-select-enable-clipboard t)
  (defun txt-cut-function (text &optional push)
    (with-temp-buffer
      (insert text)
      (call-process-region (point-min) (point-max) "wl-copy" ))
    )
  (setq interprogram-cut-function 'txt-cut-function)
#+END_SRC

** Key-chord and key-seq
Keyboard shortcuts based on double pressing of low-popularity key
combinations (e.g. 'qq'). Key-chord doesn't take account of order
(e.g. 'qa'='aq') so instead I prefer to use key-seq, which requires
the "chord" to be in the right order.

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; rapid-double press to activate key chords
  (use-package key-chord
    ;;ensure t
    :init
    (progn
      (message "Use-package: Key-chord" )
      )
    :config
    ;; Max time delay between two key presses to be considered a key chord
    (setq key-chord-two-keys-delay 0.1) ; default 0.1
    ;; Max time delay between two presses of the same key to be considered a key chord.
    ;; Should normally be a little longer than `key-chord-two-keys-delay'.
    (setq key-chord-one-key-delay 0.2) ; default 0.2    
    (key-chord-mode 1) )

  ;; NOTE: additional key-chords are defined within other use-package declarations herein.
  (use-package key-seq
    ;;ensure t
    :after key-chord
    :init
    (progn
      (message "Use-package: Key-seq" )
      ;(key-seq-define-global "kk"     'kill-whole-line)
      (key-seq-define-global "qs"     'consult-notes-search-in-all-notes) ; search org files
      (key-seq-define-global "qi"     'ibuffer-bs-show) 
      (key-seq-define-global "qw"     'other-window)
      (key-seq-define-global "qt"     'org-babel-tangle)
      (key-seq-define-global "qd"     'org-journal-new-entry)
      (key-seq-define-global "qc"     'org-capture) ) )
#+END_SRC

** Splitting window behaviour
Global keys to split the window AND follow by moving point to the new window.

#+BEGIN_SRC emacs-lisp :tangle yes
;; move focus when splitting a window
(defun split-and-follow-horizontally ()
  (interactive)
  (split-window-below)
  (balance-windows)
  (other-window 1))
(global-set-key (kbd "C-x 2") 'split-and-follow-horizontally)
;; move focus when splitting a window
(defun split-and-follow-vertically ()
  (interactive)
  (split-window-right)
  (balance-windows)
  (other-window 1))
(global-set-key (kbd "C-x 3") 'split-and-follow-vertically)
#+END_SRC

** Editorconfig
Set configuration on a per directory basis via .editorconfig.

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; editorconfig allows specification of tab/space/indent
  (use-package editorconfig
    ;;ensure t
    :delight (editorconfig-mode "Ec")
    :init
    (message "Use-package: EditorConfig")
    :config
    (editorconfig-mode 1) )
(setq whitespace-style '(trailing tabs newline tab-mark newline-mark))
#+END_SRC

** Yasnippet
Expand roots to standard text snippets with M-].

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; location of my snippets -- has to go before yas-reload-all
  (setq-default yas-snippet-dirs '("/home/hewitt/.emacs.d/my_snippets"))
  ;; include yansippet and snippets
  (use-package yasnippet
    :delight (yas-minor-mode "YaS")
    ;;ensure t
    :init
    (message "Use-package: YASnippet")
    :config
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;;;; hooks for YASnippet in Latex, C++, elisp & org ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    (add-hook 'c++-mode-hook 'yas-minor-mode)  
    (add-hook 'latex-mode-hook 'yas-minor-mode)
    (add-hook 'emacs-lisp-mode-hook 'yas-minor-mode)
    (add-hook 'org-mode-hook 'yas-minor-mode)
    ;; remove default keybinding
    (define-key yas-minor-mode-map (kbd "<tab>") nil)
    (define-key yas-minor-mode-map (kbd "TAB") nil)
    ;; redefine my own key
    (define-key yas-minor-mode-map (kbd "M-]") yas-maybe-expand)
    ;; remove default keys for navigation
    (define-key yas-keymap [(tab)]       nil)
    (define-key yas-keymap (kbd "TAB")   nil)
    (define-key yas-keymap [(shift tab)] nil)
    (define-key yas-keymap [backtab]     nil)
    ;; redefine my own keys
    (define-key yas-keymap (kbd "M-n") 'yas-next-field-or-maybe-expand)
    (define-key yas-keymap (kbd "M-p") 'yas-prev-field)  
    (yas-reload-all) )
#+END_SRC


