config.el

(use-package consult
  ;;ensure t
  :after key-seq
  :init
  (message "Use-package: consult")
  :bind
  ;; see also key-chords elsewhere
  ("C-x b" . consult-buffer)
  ("M-g g" . consult-goto-line)
  ("M-y"   . consult-yank-pop)
  ("C-y"   . yank)
  ("C-s"   . consult-line)
  ("M-g o" . consult-outline))

  ;; define some related chords
  (key-seq-define-global "qq"     'consult-buffer)
  (key-seq-define-global "qb"     'consult-bookmark) ; set or jump
  (key-seq-define-global "ql"     'consult-goto-line)

(use-package consult-notes
  :commands (consult-notes consult-notes-search-in-all-notes)
  :config
  ;(setq consult-notes-file-dir-sources
  ;      '(("Org"         ?o "~/Sync/Org/Denote/")
  ;        ("Journal"      ?j "~/Sync/Org/Journal/")))    
  ;(consult-notes-org-headings-mode)
  (consult-notes-denote-mode))

(use-package vertico
  ;;ensure t
  :custom
  (vertico-cycle t)
  :init
  (message "Use-package: vertico")
  (vertico-mode))

(use-package savehist
  :init
  (savehist-mode))

;; (use-package vertico-posframe
;;   :config
;;   (setq vertico-posframe-border-width 3)
;;   (setq vertico-posframe-mode t)
;;   (setq vertico-posframe-poshandler 'posframe-poshandler-frame-top-center)
;;   (setq vertico-posframe-width 100))

 (use-package orderless
  ;;ensure t
  :custom (completion-styles '(orderless)))

(use-package marginalia
  :after vertico
  ;;ensure t
  :custom
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  :init
  (message "Use-package: marginalia")
  (marginalia-mode))

;; rapid-double press to activate key chords
(use-package key-chord
  ;;ensure t
  :init
  (progn
    (message "Use-package: Key-chord" )
    )
  :config
  ;; Max time delay between two key presses to be considered a key chord
  (setq key-chord-two-keys-delay 0.1) ; default 0.1
  ;; Max time delay between two presses of the same key to be considered a key chord.
  ;; Should normally be a little longer than `key-chord-two-keys-delay'.
  (setq key-chord-one-key-delay 0.2) ; default 0.2    
  (key-chord-mode 1) )

;; NOTE: additional key-chords are defined within other use-package declarations herein.
(use-package key-seq
  ;;ensure t
  :after key-chord
  :init
  (progn
    (message "Use-package: Key-seq" )
    ;(key-seq-define-global "kk"     'kill-whole-line)
    (key-seq-define-global "qs"     'consult-notes-search-in-all-notes) ; search org files
    (key-seq-define-global "qi"     'ibuffer-bs-show) 
    (key-seq-define-global "qw"     'other-window)
    (key-seq-define-global "qt"     'org-babel-tangle)
    (key-seq-define-global "qd"     'org-journal-new-entry)
    (key-seq-define-global "qc"     'org-capture) ) )

;; move focus when splitting a window
(defun split-and-follow-horizontally ()
  (interactive)
  (split-window-below)
  (balance-windows)
  (other-window 1))
(global-set-key (kbd "C-x 2") 'split-and-follow-horizontally)
;; move focus when splitting a window
(defun split-and-follow-vertically ()
  (interactive)
  (split-window-right)
  (balance-windows)
  (other-window 1))
(global-set-key (kbd "C-x 3") 'split-and-follow-vertically)

;; editorconfig allows specification of tab/space/indent
  (use-package editorconfig
    ;;ensure t
    :delight (editorconfig-mode "Ec")
    :init
    (message "Use-package: EditorConfig")
    :config
    (editorconfig-mode 1) )
(setq whitespace-style '(trailing tabs newline tab-mark newline-mark))

;; location of my snippets -- has to go before yas-reload-all
(setq-default yas-snippet-dirs '("/home/hewitt/.emacs.d/my_snippets"))
;; include yansippet and snippets
(use-package yasnippet
  :delight (yas-minor-mode "YaS")
  ;;ensure t
  :init
  (message "Use-package: YASnippet")
  :config
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;;;; hooks for YASnippet in Latex, C++, elisp & org ;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  (add-hook 'c++-mode-hook 'yas-minor-mode)  
  (add-hook 'latex-mode-hook 'yas-minor-mode)
  (add-hook 'emacs-lisp-mode-hook 'yas-minor-mode)
  (add-hook 'org-mode-hook 'yas-minor-mode)
  ;; remove default keybinding
  (define-key yas-minor-mode-map (kbd "<tab>") nil)
  (define-key yas-minor-mode-map (kbd "TAB") nil)
  ;; redefine my own key
  (define-key yas-minor-mode-map (kbd "M-]") yas-maybe-expand)
  ;; remove default keys for navigation
  (define-key yas-keymap [(tab)]       nil)
  (define-key yas-keymap (kbd "TAB")   nil)
  (define-key yas-keymap [(shift tab)] nil)
  (define-key yas-keymap [backtab]     nil)
  ;; redefine my own keys
  (define-key yas-keymap (kbd "M-n") 'yas-next-field-or-maybe-expand)
  (define-key yas-keymap (kbd "M-p") 'yas-prev-field)  
  (yas-reload-all) )
