config.org
* Coding environment

Code completion and on-the-fly check/make.

- interaction with a language back-end is done via "eglot" which is an
  alternative to lsp-mode.

- IN-REGION completion is provided by Corfu (Completion Overlay Region
  FUnction). This provides at-point completion in the main buffer
  rather than via a mini-buffer. Completion is requested with a key
  binding.

- Note for eglot: On my Ubuntu 20.04 LTS installation I had to apt
  install g++ with a version that matched the latest version of the
  gcc compiler as noted in the FAQ for ccls: "For example, if you have
  gcc-7, g++-7 and gcc-8 installed (note the omission of g++-8). clang
  may pick the gcc toolchain with the largest version number."

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package corfu
    ;;ensure t
    :init (message "Use-package: Corfu")
    :hook
    (prog-mode . corfu-mode)
    (latex-mode . corfu-mode)
    (org-mode . corfu-mode) )

  ;; GIT-GUTTER: SHOW changes relative to git repo
  (use-package git-gutter
    ;;ensure t
    :defer t
    :delight (git-gutter-mode "Gg")
    :init (message "Use-package: Git-Gutter")
    :hook
    (prog-mode . git-gutter-mode)
    (org-mode . git-gutter-mode) )

  ;; eglot is a simpler alternative to LSP-mode
  (use-package eglot
    ;;ensure t
    :delight (eglot "Eglot")
    :init
    (message "Use-package: Eglot")
    (add-hook 'c++-mode-hook 'eglot-ensure)
    (add-hook 'latex-mode-hook 'eglot-ensure) 
    :custom
    (add-to-list 'eglot-server-programs '(c++-mode . ("ccls")))
    (add-to-list 'eglot-server-programs '(latex-mode . ("digestif"))) )

  ;; NIX language mode
  (use-package nix-mode
    :delight (nix-mode "Nx")
    :mode "\\.nix\\'" ) 

  ;; company gives the selection front end for code completion
  ;; but not the C++-aware backend
  (use-package company
    ;;ensure t
    :delight (company-mode "Co")
    :bind ("M-/" . company-complete)
    :init
    (progn
      (message "Use-package: Company")
      (add-hook 'after-init-hook 'global-company-mode) )
    :config
    (require 'yasnippet)
    (setq company-idle-delay 1)
    (setq company-minimum-prefix-length 3)
    (setq company-idle-delay 0)
    (setq company-selection-wrap-around t)
    (setq company-tooltip-align-annotations t)
    (setq company-frontends '(company-pseudo-tooltip-frontend 
                              company-echo-metadata-frontend) ) )
#+END_SRC


* Magit
Trying to use it!

#+BEGIN_SRC emacs-lisp :tangle yes
;; MAGIT
(use-package magit
  ;;ensure t
  :defer t
  :bind
  ("C-x g" . magit-status)
  :init
  (message "Use-package: Magit installed")
  )
#+END_SRC


* Org mode
** Basics of Org mode
A fairly standard Org mode configuration. Some minor tweaks to
colourise bold/italic/underline for use with bitmap fonts.

#+BEGIN_SRC  emacs-lisp :tangle yes
  (use-package org
    ;;ensure t
    :after key-seq
    :init
    (message "Use-package: Org") )

  ;; fancy replace of *** etc
  (use-package org-bullets
    ;;ensure t
    :after org
    :init
    (add-hook 'org-mode-hook 'org-bullets-mode)
    (message "Use-package: Org-bullets") )

  ;; replace emphasis with colors in Org files
  (setq org-emphasis-alist
         '(("*" my-org-emphasis-bold)
           ("/" my-org-emphasis-italic)
           ("_" underline)
           ("=" org-verbatim verbatim)
           ("~" org-code verbatim)
           ("+" (:strike-through t))))

   (defface my-org-emphasis-bold
     '((default :inherit bold)
       (((class color) (min-colors 88) (background light))
        :foreground "#a60000")
       (((class color) (min-colors 88) (background dark))
        :foreground "#ff8059"))
     "My bold emphasis for Org.")

   (defface my-org-emphasis-italic
     '((default :inherit italic)
       (((class color) (min-colors 88) (background light))
        :foreground "#005e00")
       (((class color) (min-colors 88) (background dark))
        :foreground "#44bc44"))
     "My italic emphasis for Org.")

   (defface my-org-emphasis-underline
     '((default :inherit underline)
       (((class color) (min-colors 88) (background light))
        :foreground "#813e00")
       (((class color) (min-colors 88) (background dark))
        :foreground "#d0bc00"))
     "My underline emphasis for Org.")


     ;; ORG link to mu4e emails -- see mu from https://github.com/djcb/mu
     ;(require 'org-mu4e)
     ;(setq org-mu4e-link-query-in-headers-mode nil)

     ;; custom capture
     (require 'org-capture)
     ;;(define-key global-map "\C-cc" 'org-capture) ; see key-chord/seq
     (setq org-capture-templates
           '(
             ("t" "Todo" entry (file+headline "~/Sync/Org/Todo.org" "Inbox")
              "* TODO %?\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n%a\n")
             ("z" "Zoom meeting" entry (file+headline "~/Sync/Org/Todo.org" "Meetings")
              "* TODO Zoom, %?\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n%i\n"
              :empty-lines 1)) )

     ;; Agenda is constructed from org files in ONE directory
     (setq org-agenda-files '("~/Sync/Org"))

     ;; refile to targets defined by the org-agenda-files list above
     (setq org-refile-targets '((nil :maxlevel . 3)
                                (org-agenda-files :maxlevel . 3)))
     (setq org-outline-path-complete-in-steps nil)         ; Refile in a single go
     (setq org-refile-use-outline-path t)                  ; Show full paths for refiling

     ;; store DONE time in the drawer
     (setq org-log-done (quote time))
     (setq org-log-into-drawer t)

     ;; Ask and store note if rescheduling
     (setq org-log-reschedule (quote note))

     ;; syntax highlight latex in org files
     (setq org-highlight-latex-and-related '(latex script entities))

     ;; define the number of days to show in the agenda
     (setq org-agenda-span 14
           org-agenda-start-on-weekday nil
           org-agenda-start-day "-3d")

     ;; used for org timers?
     (key-seq-define-global "qp"     'org-timer-set-timer)
     ;; default duration of events
     (setq org-agenda-default-appointment-duration 60)

     (setq org-agenda-prefix-format '(
      ;;;; (agenda  . " %i %-12:c%?-12t% s") ;; file name + org-agenda-entry-type
                                      (agenda  . "  •  %-12:c%?-12t% s")
                                      (timeline  . "  % s")
                                      (todo  . " %i %-12:c")
                                      (tags  . " %i %-12:c")
                                      (search . " %i %-12:c")))
    
#+END_SRC

** Org-babel

Reproducible research aide.

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; (use-package gnuplot
  ;;     :ensure t
  ;;     :init
  ;;     (message "Use-package: gnuplot for babel installed") )
  ;;   ;; languages I work in via babel
  ;;   (org-babel-do-load-languages
  ;;    'org-babel-load-languages
  ;;    '((gnuplot . t) (emacs-lisp . t) (shell . t) (python . t)))
  ;;   ;; stop it asking if I'm sure about evaluation
  ;;   (setq org-confirm-babel-evaluate nil)

   (defun my-tab-related-stuff ()
     (setq indent-tabs-mode nil)
     ;;(setq tab-stop-list (number-sequence 4 200 4))
     (setq tab-width 2)
     ;;(setq indent-line-function 'insert-tab)
     )

  (add-hook 'org-mode-hook 'my-tab-related-stuff)
#+END_SRC

