config.org
** Denote
This is an Org-roam alternative. It appeals to me because of its
simplicity, focus, spectacular documentation and its from an author
who writes great content.

Searching the Denote files is done via the "consult-notes" package. 

#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'denote)

  ;; Remember to check the doc strings of those variables.
  (setq denote-directory (expand-file-name "~/Sync/Org/Denote/"))
  (setq denote-known-keywords '("research" "admin" "industry" "teaching" "home" "attachment"))
  (setq denote-infer-keywords t)
  (setq denote-sort-keywords t)
  (setq denote-file-type nil) ; Org is the default, set others here
  (setq denote-prompts '(title keywords))

  ;; We allow multi-word keywords by default.  The author's personal
  ;; preference is for single-word keywords for a more rigid workflow.
  (setq denote-allow-multi-word-keywords t)

  (setq denote-date-format nil) ; read doc string

  ;; You will not need to `require' all those individually once the
  ;; package is available.
  ;;(require 'denote-retrieve)
  ;;(require 'denote-link)

  ;; By default, we fontify backlinks in their bespoke buffer.
  (setq denote-link-fontify-backlinks t)

  ;; Also see `denote-link-backlinks-display-buffer-action' which is a bit
  ;; advanced.

  ;; If you use Markdown or plain text files (Org renders links as buttons
  ;; right away)
  (add-hook 'find-file-hook #'denote-link-buttonize-buffer)

  ;;(require 'denote-dired)
  (setq denote-dired-rename-expert nil)

  ;; We use different ways to specify a path for demo purposes.
  ;;(setq denote-dired-directories
  ;;      (list denote-directory
  ;;            (thread-last denote-directory (expand-file-name "attachments"))
  ;;            (expand-file-name "~/Documents/books")))

  ;; Generic (great if you rename files Denote-style in lots of places):
  ;; (add-hook 'dired-mode-hook #'denote-dired-mode)
  ;;
  ;; OR if only want it in `denote-dired-directories':
  (add-hook 'dired-mode-hook #'denote-dired-mode-in-directories)

  ;; Denote does not define any key bindings.  This is for the user to
  ;; decide.  For example:
  (let ((map global-map))
    (define-key map (kbd "C-c n n") #'denote)
    (define-key map (kbd "C-c n N") #'denote-type)
    (define-key map (kbd "C-c n d") #'denote-date)
    (define-key map (kbd "C-c n s") #'denote-subdirectory)
    ;; If you intend to use Denote with a variety of file types, it is
    ;; easier to bind the link-related commands to the `global-map', as
    ;; shown here.  Otherwise follow the same pattern for `org-mode-map',
    ;; `markdown-mode-map', and/or `text-mode-map'.
    (define-key map (kbd "C-c n i") #'denote-link) ; "insert" mnemonic
    (define-key map (kbd "C-c n I") #'denote-link-add-links)
    (define-key map (kbd "C-c n l") #'denote-link-find-file) ; "list" links
    (define-key map (kbd "C-c n b") #'denote-link-backlinks)
    ;; Note that `denote-dired-rename-file' can work from any context, not
    ;; just Dired bufffers.  That is why we bind it here to the
    ;; `global-map'.
    (define-key map (kbd "C-c n r") #'denote-dired-rename-file))

  (with-eval-after-load 'org-capture    
    (setq denote-org-capture-specifiers "%l\n%i\n%?")
    (add-to-list 'org-capture-templates
                 '("n" "New note (with denote.el)" plain
                   (file denote-last-path)
                   #'denote-org-capture
                   :no-save t
                   :immediate-finish nil
                   :kill-buffer t
                   :jump-to-captured t)))

  ;; I still like "org-journal" rather than using "denote".
  (use-package org-journal
    ;;ensure t
    :init
    (message "Use-package: Org-journal")
    :config
    (setq org-journal-dir "~/Sync/Org/Journal/"
          org-journal-date-format "%A, %d %B %Y"
          org-journal-file-format "%Y_%m_%d"
          org-journal-time-prefix "  - "
          org-journal-time-format nil
          org-journal-file-type 'monthly)  )

#+END_SRC 
                 
** Search through the Org/Denote directory via Deft

Allows direct searching of my Denote notes.

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package deft
    ;;ensure t
    :init
    (message "Use-package: Deft")
    :config
    (setq deft-recursive t)
    ;; Org-Roam v2 now stores :properties: on line 1, so below uses the filename in deft list
    ;; (setq deft-use-filename-as-title t)
    ;; Prot's "denote" doesn't need above
    (setq deft-default-extension "org")
    (setq deft-directory "/home/hewitt/Sync/Org/Denote")
    )
#+END_SRC


* Elfeed

2022: taken out.

RSS reader. The feed list can be setq below.

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package elfeed
    ;;ensure t
    :config
    (setq elfeed-use-curl t)
    (setq elfeed-curl-max-connections 10)
    (setq elfeed-db-directory "~/.emacs.d/elfeed/")
    (setq elfeed-enclosure-default-dir "~/Downloads/")
    (setq elfeed-search-filter "@1-week-ago +unread")
    (setq elfeed-sort-order 'descending)
    ;(setq elfeed-search-clipboard-type 'CLIPBOARD)
    (setq elfeed-search-title-max-width 100)
    (setq elfeed-search-title-min-width 30)
    (setq elfeed-search-trailing-width 25)
    (setq elfeed-show-truncate-long-urls t)
    (setq elfeed-show-unique-buffers t)
    (setq elfeed-feeds
     '(("https://protesilaos.com/codelog.xml" emacs tech)
       ("https://irreal.org/blog/?feed=rss2" emacs tech)
       ("http://feeds.feedburner.com/XahsEmacsBlog" emacs tech)
       ("http://pragmaticemacs.com/feed/" emacs tech)
       ("http://feeds.bbci.co.uk/news/technology/rss.xml" news tech)
       ("https://www.theverge.com/rss/index.xml" news tech)
       ("https://emacsredux.com/atom.xml" emacs tech)
       ("https://www.phoronix.com/rss.php" tech)
       ("https://www.techradar.com/uk/rss/news/computing" tech)
       ))
    ;; see https://protesilaos.com/dotemacs/
    (defun prot/elfeed-show-eww (&optional link)
      "Browse current `elfeed' entry link in `eww'.
  Only show the readable part once the website loads.  This can
  fail on poorly-designed websites."
      (interactive)
      (let* ((entry (if (eq major-mode 'elfeed-show-mode)
                        elfeed-show-entry
                      (elfeed-search-selected :ignore-region)))
             (link (if link link (elfeed-entry-link entry))))
        (eww link)
        (add-hook 'eww-after-render-hook 'eww-readable nil t))
        ) ;close defun

    :bind
    (("C-c f" . elfeed)
           :map elfeed-search-mode-map
          ("e" . prot/elfeed-show-eww)
          ) )
#+END_SRC
 

* PDF tools
This is a great tool if you have to comment on or otherwise annotate
PDFs. The standard method for adding a text comment can be faster
than trying to scribble a hadnwritten note via other methods.

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; pdf tools for organising and annotating PDF
  (use-package pdf-tools
    ;;ensure t
    :config
    (pdf-tools-install) )
#+END_SRC
 

