config.el

;; Feb 2023 : mu is not installed via Nix so no need to specialise
;; mu4e is part of the "mu" package and sometimes doesn't get
;; found auto-magically. So this points directly to it.
;; (add-to-list 'load-path "/home/hewitt/local/share/emacs/site-lisp/mu4e")

;; defines mu4e exists, but holds off until needed
(autoload 'mu4e "mu4e" "Launch mu4e and show the main window" t)

;; used for outgoing mail send
(use-package smtpmail
  ;;ensure t
  :defer t
  :init
  (message "Use-package: SMTPmail")
  (setq message-send-mail-function 'smtpmail-send-it
        user-mail-address "richard.hewitt@manchester.ac.uk"
        ;;smtpmail-default-smtp-server "outgoing.manchester.ac.uk"
        smtpmail-default-smtp-server "localhost" ; davmail runs locally
        ;;smtpmail-local-domain "manchester.ac.uk"
        smtpmail-smtp-server "localhost"
        ;;smtpmail-stream-type 'starttls
        smtpmail-smtp-service 1025) )

;; 2018 : this stops errors associated with duplicated UIDs -- LEAVE IT HERE!
(setq mu4e-change-filenames-when-moving t)
;; general mu4e config
(setq mu4e-maildir (expand-file-name "/home/hewitt/CURRENT/mbsyncmail"))
(setq mu4e-drafts-folder "/Drafts")
(setq mu4e-sent-folder   "/Sent") ; they still seem to appear in O365 despite this not being "Sent Items"
(setq mu4e-trash-folder  "/Deleted Items") ; I don't sync Deleted Items & largely do permanent delete "D" rather than move to trash "d"
(setq message-signature-file "/home/hewitt/CURRENT/dot.signature")
(setq mu4e-headers-show-thread nil)
(setq mu4e-headers-include-related nil)
(setq mu4e-headers-results-limit 200)
(setq mu4e-mu-binary (executable-find "mu"))
;; stop mail draft/sent appearing in the recent files list of the dashboard
;;(add-to-list 'recentf-exclude "\\mbsyncmail\\")
;; how to get mail
(setq mu4e-get-mail-command "mbsync Work"
      mu4e-html2text-command "w3m -T text/html"
      ;;mu4e-html2text-command "html2markdown --body-width=72" 
      ;;mu4e-update-interval 300
      ;;mu4e-headers-auto-update t
      mu4e-compose-signature-auto-include t)

;; the headers to show 
;; in the headers list -- a pair of a field
;; and its width, with `nil' meaning 'unlimited'
;; better only use that for the last field.
;; These are the defaults:
(setq mu4e-headers-fields
      '((:human-date    .  15)    ;; alternatively, use :date
        (:flags        .   6)
        (:from         .  22)
        (:subject      .  nil))  ;; alternatively, use :thread-subject
      )
(setq mu4e-maildir-shortcuts
      '( ("/INBOX"          . ?i)
         ("/Sent"           . ?s)
         ("/Deleted Items"  . ?t)
         ("/Drafts"         . ?d)) )
;; REMOVE BELOW FOR TERMINAL EMACS
;; show images
(setq mu4e-show-images t)
;; use imagemagick, if available
(when (fboundp 'imagemagick-register-types)
  (imagemagick-register-types) )
;; don't keep message buffers around
(setq message-kill-buffer-on-exit t)
;; general emacs mail settings; used when composing e-mail
;; the non-mu4e-* stuff is inherited from emacs/message-mode
(setq mu4e-reply-to-address "richard.hewitt@manchester.ac.uk"
      user-mail-address "richard.hewitt@manchester.ac.uk"
      user-full-name  "Rich Hewitt")
(setq mu4e-sent-messages-behavior 'sent)

;; spell check during compose
(add-hook 'mu4e-compose-mode-hook
          (defun my-do-compose-stuff ()
            "My settings for message composition."
            (set-fill-column 72)
            (flyspell-mode)
            ;; turn off autosave, otherwise we end up with multiple
            ;; versions of sent/draft mail being sync'd
            (auto-save-mode -1) ) )

(use-package age
  ;;; :quelpa (age :fetcher github :repo "anticomputer/age.el") 
  :ensure t
  :demand
  :custom
  (age-program "rage")
  (age-default-identity "~/CURRENT/AGE/age-yubikey-identity-bb978fd1.txt")
  (age-default-recipient
   '("~/CURRENT/AGE/backupKey.pub"
     "~/CURRENT/AGE/age-yubikey-identity-bb978fd1.pub"))
  :config
  (setq age-armor nil) ;; don't convert to ASCII so I can see the key headers
  (age-file-enable))

(defun meow-setup ()
  (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty)
  (meow-motion-overwrite-define-key
   '("j" . meow-next)
   '("k" . meow-prev)
   '("<escape>" . ignore))

  (meow-leader-define-key
   ;; SPC j/k will run the original command in MOTION state.
   '("j" . "H-j")
   '("k" . "H-k")
   ;; Use SPC (0-9) for digit arguments.
   '("1" . meow-digit-argument)
   '("2" . meow-digit-argument)
   '("3" . meow-digit-argument)
   '("4" . meow-digit-argument)
   '("5" . meow-digit-argument)
   '("6" . meow-digit-argument)
   '("7" . meow-digit-argument)
   '("8" . meow-digit-argument)
   '("9" . meow-digit-argument)
   '("0" . meow-digit-argument)
   '("/" . meow-keypad-describe-key)
   '("?" . meow-cheatsheet))

  (meow-normal-define-key
   '("0" . meow-expand-0)
   '("9" . meow-expand-9)
   '("8" . meow-expand-8)
   '("7" . meow-expand-7)
   '("6" . meow-expand-6)
   '("5" . meow-expand-5)
   '("4" . meow-expand-4)
   '("3" . meow-expand-3)
   '("2" . meow-expand-2)
   '("1" . meow-expand-1)
   '("-" . negative-argument)
   '(";" . meow-reverse)
   ;; SELECTION
   '("," . meow-inner-of-thing) 
   '("." . meow-bounds-of-thing)
   '("g" . meow-cancel-selection)
   '("H" . meow-left-expand)
   '("J" . meow-next-expand)
   '("K" . meow-prev-expand)
   '("L" . meow-right-expand)
   '("[" . meow-beginning-of-thing)
   '("]" . meow-end-of-thing)
   ;; MOVEMENT
   '("b" . meow-back-word)
   '("B" . meow-back-symbol)
   '("e" . meow-next-word)
   '("E" . meow-next-symbol)
   '("h" . meow-left)
   '("j" . meow-next)
   '("k" . meow-prev)
   '("l" . meow-right)
   ;; EDIT
   '("c" . meow-change)
   '("d" . meow-delete)
   '("D" . meow-backward-delete)
   '("i" . meow-insert)
   '("a" . meow-append)
   '("I" . meow-open-above)
   '("A" . meow-open-below)
   '("s" . meow-kill)
   ;;
   ;; SEARCH
   '("f" . meow-find)
   '("G" . meow-grab)
   '("m" . meow-join)
   '("n" . meow-search)
   '("o" . meow-block)
   '("O" . meow-to-block)
   '("p" . meow-yank)
   '("q" . meow-quit)
   '("Q" . meow-goto-line)
   '("r" . meow-replace)
   '("R" . meow-swap-grab)
   ;;'("t" . meow-till)
   '("u" . meow-undo)
   '("U" . meow-undo-in-selection)
   '("v" . meow-visit)
   '("w" . meow-mark-word)
   '("W" . meow-mark-symbol)
   '("x" . meow-line)
   '("X" . meow-goto-line)
   '("y" . meow-save)
   '("Y" . meow-sync-grab)
   '("z" . meow-pop-selection)
   '("'" . repeat)
   '("<escape>" . ignore)))

   (require 'meow)
   (meow-setup)
   (meow-global-mode 1)

;; simple prefix key launcher
(global-set-key (kbd "C-c h m") 'mu4e)
(global-set-key (kbd "C-c h a") 'org-agenda)
;; C-c h e : edit the init.el configuration file
(defun config-visit ()
  (interactive)
  (find-file "~/CURRENT/NixConfig/outOfStore/.emacs.d/config.org") )
(global-set-key (kbd "C-c h e") 'config-visit)
;; C-c h e : edit the init.el configuration file
(defun todo-visit ()
  (interactive)
  (find-file "~/Sync/Org/Todo.org") )
(global-set-key (kbd "C-c h t") 'todo-visit)

;; load default theme last.
(load-theme 'ef-duo-dark :no-confirm)

;; because we use daemon/client we have to initiate the posframe
;; mode only once a frame is made
;;(add-hook 'after-make-frame-functions
;;  (lambda (frame)
;;    (select-frame frame)
;;    (when (display-graphic-p frame)
;;      (vertico-posframe-mode 1))))
